ExchangePlans/СинхронизацияДанныхЧерезУниверсальныйФормат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<ExchangePlan>
		<Properties>
			<Name>СинхронизацияДанныхЧерезУниверсальныйФормат</Name>
			<Comment>Синхронизация данных через универсальный формат XDTO между различными конфигурациями</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВариантНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияФорматаОбмена</Name>
					<Comment>Версия формата обмена в формате ХХ.ХХ.ХХ.ХХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаВыгрузкиДокументов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОтборПоОрганизациям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилаОтправкиДокументов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>27</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилаОтправкиСправочников</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрироватьИзменения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимВыгрузкиДокументов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РежимыВыгрузкиОбъектовОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимВыгрузкиПриНеобходимости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РежимыВыгрузкиОбъектовОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимВыгрузкиСправочников</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РежимыВыгрузкиОбъектовОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеДляФормированияПроводокОтправлятьСводно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьРегламентированныеОтчеты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьВедомости</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьВедомостиКакЗаявки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяВерсияФормата_1_17</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьСотрудников</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьВсехФизическихЛиц</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьБухучет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьСтатистикуПерсонала</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьУдержанныйНДФЛ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьРезервы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьВидыРабот</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьВсеДолжности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьРегистрацииНО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьСтруктуруПредприятия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Организации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ШаблоныВводаИсходныхДанных</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Шаблон</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыДокументовВводДанныхДляРасчетаЗарплаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ExchangePlan>
</MetaDataObject>

ExchangePlans/СинхронизацияДанныхЧерезУниверсальныйФормат/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	// Проверка значения свойства ОбменДанными.Загрузка отсутствует по причине того, что в расположенным ниже коде,
	// реализована логика, которая должна выполняться в том числе при установке этого свойства равным Истина
	// (на стороне кода, который выполняет попытку записи в данный план обмена).
	
	// Очистка неиспользуемых реквизитов и заполнение служебных.
	Если ПравилаОтправкиСправочников = "НеСинхронизировать" Тогда
		ИспользоватьОтборПоОрганизациям = Ложь;
		РежимВыгрузкиСправочников       = Перечисления.РежимыВыгрузкиОбъектовОбмена.НеВыгружать;
		РежимВыгрузкиПриНеобходимости   = Перечисления.РежимыВыгрузкиОбъектовОбмена.НеВыгружать;
	ИначеЕсли ПравилаОтправкиСправочников = "СинхронизироватьПоНеобходимости" Тогда
		РежимВыгрузкиПриНеобходимости 	= Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьПриНеобходимости;
		РежимВыгрузкиСправочников 		= Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьПриНеобходимости;
	Иначе
		РежимВыгрузкиПриНеобходимости 	= Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьПриНеобходимости;
		РежимВыгрузкиСправочников 		= Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьПоУсловию;
	КонецЕсли;
	
	Если ПравилаОтправкиДокументов = "НеСинхронизировать" Тогда
		РежимВыгрузкиДокументов = Перечисления.РежимыВыгрузкиОбъектовОбмена.НеВыгружать;
	ИначеЕсли ПравилаОтправкиДокументов = "ИнтерактивнаяСинхронизация" Тогда
		РежимВыгрузкиДокументов = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьВручную;
	Иначе
		РежимВыгрузкиДокументов = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьПоУсловию;
	КонецЕсли;
	
	Если Не ИспользоватьОтборПоОрганизациям И Организации.Количество() <> 0 Тогда
		Организации.Очистить();
	ИначеЕсли Организации.Количество() = 0 И ИспользоватьОтборПоОрганизациям Тогда
		ИспользоватьОтборПоОрганизациям = Ложь;
	КонецЕсли;
	
	Если ПравилаОтправкиДокументов <> "АвтоматическаяСинхронизация" Тогда
		ДатаНачалаВыгрузкиДокументов = Дата(1,1,1,0,0,0);
	КонецЕсли;
	
	Если ВариантНастройки = "ОбменДОЗУП" Тогда
		ВариантНастройки = ОбменДаннымиУниверсальныйФормат.ВариантНастройкиОбменаДО();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ВерсияФорматаОбмена) Тогда
		Если ВариантНастройки = ОбменДаннымиУниверсальныйФормат.ВариантНастройкиОбменаДО()
			Или ВариантНастройки = ОбменДаннымиУниверсальныйФормат.ВариантНастройкиОбменаУНФ() Тогда
			ВерсияФорматаОбмена = "1.17";
		Иначе
			ВерсияФорматаОбмена = "1.8";
		КонецЕсли;
	КонецЕсли;
	
	Если Не ОтправлятьВедомости И ОтправлятьВедомостиКакЗаявки Тогда
		ОтправлятьВедомостиКакЗаявки = Ложь;
	КонецЕсли;
	
	ИспользуетсяВерсияФормата_1_17 = Не ВерсияФорматаНижеВерсии("1.17");

	Если ВариантНастройки = ОбменДаннымиУниверсальныйФормат.ВариантНастройкиОбменаДО() Тогда
		ОтправлятьСпуктуруПредприятия = ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы");
		ОтправлятьСтруктуруПредприятия 	= ОтправлятьСпуктуруПредприятия;
		ОтправлятьСотрудников 			= Истина;
		Если Не ИспользуетсяВерсияФормата_1_17 Тогда
			ВерсияФорматаОбмена = "1.17";
			ИспользуетсяВерсияФормата_1_17 = Истина;
		КонецЕсли;
	ИначеЕсли ВариантНастройки = ОбменДаннымиУниверсальныйФормат.ВариантНастройкиОбменаУНФ() И Не ИспользуетсяВерсияФормата_1_17 Тогда
		ВерсияФорматаОбмена = "1.17";
		ИспользуетсяВерсияФормата_1_17 = Истина;
	КонецЕсли;
	
	Если Не ИспользуетсяВерсияФормата_1_17 Тогда
		ОтправлятьСотрудников = Ложь;
	КонецЕсли;
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновление кэшируемых данных, зависящих от значений реквизитов данного узла обмена.
	Если Не ОбщегоНазначения.РазделениеВключено() Тогда
		ОбменДаннымиВызовСервера.СброситьКэшМеханизмаРегистрацииОбъектов();
		ОбновитьПовторноИспользуемыеЗначения();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ОбменДаннымиУниверсальныйФормат.ОбновитьНастройкиИспользованияОбмена(ЭтотОбъект, Истина);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("Загрузка")
		Или ДополнительныеСвойства.Свойство("ПолучениеСообщенияОбмена") Тогда
		// Это запись номера принятого/отправленного сообщения в узел обмена.
		Возврат;
	КонецЕсли;
	
	ОбменДаннымиУниверсальныйФормат.ОбновитьНастройкиИспользованияОбмена(ЭтотОбъект, ПометкаУдаления);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ИнициализироватьОбъект(ДанныеЗаполнения);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ИнициализироватьОбъект(ДанныеЗаполнения)
	
	Если Не ДанныеЗаполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РежимВыгрузкиПриНеобходимости = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьПриНеобходимости;
	
	ДатаНачалаВыгрузкиДокументов = НачалоГода(ТекущаяДата());
	ПравилаОтправкиСправочников = "АвтоматическаяСинхронизация";
	ПравилаОтправкиДокументов = "АвтоматическаяСинхронизация";
	
	Если ЗначениеЗаполнено(ВариантНастройки) Тогда
		НастроитьОтборыПоУмолчанию();
	КонецЕсли;
	
КонецПроцедуры

Процедура НастроитьОтборыПоУмолчанию()
	
	Если ВариантНастройки = ОбменДаннымиУниверсальныйФормат.ВариантНастройкиОбменаБП() Тогда
		
		ВерсияФорматаОбмена = "1.8";
		
		ОтправлятьВедомостиКакЗаявки 	= Ложь;
		ОтправлятьВсехФизическихЛиц 	= Ложь;
		ОтправлятьБухучет 				= Истина;
		ОтправлятьСтатистикуПерсонала 	= Истина;
		ОтправлятьУдержанныйНДФЛ 		= Истина;
		ОтправлятьРезервы 				= Истина;
		ОтправлятьВидыРабот 			= Ложь;
		ОтправлятьВсеДолжности 			= Ложь;
		ОтправлятьРегистрацииНО 		= Истина;
		ОтправлятьСтруктуруПредприятия 	= Ложь;
		
		ОтправлятьРегламентированныеОтчеты 	= Ложь;
		ОтправлятьВедомости 				= Истина;
		ОтправлятьСотрудников 				= Ложь;
		
	ИначеЕсли ВариантНастройки = ОбменДаннымиУниверсальныйФормат.ВариантНастройкиОбменаERP() Тогда
		
		ВерсияФорматаОбмена = "1.3";
		
		ДанныеДляФормированияПроводокОтправлятьСводно = Истина;
		ОтправлятьРегламентированныеОтчеты 	= Ложь;
		ОтправлятьВсехФизическихЛиц 		= Истина;
		ОтправлятьБухучет 					= Истина;
		ОтправлятьСтатистикуПерсонала 		= Истина;
		ОтправлятьУдержанныйНДФЛ 			= Истина;
		ОтправлятьРезервы 					= Истина;
		ОтправлятьВидыРабот 				= Истина;
		ОтправлятьВсеДолжности 				= Ложь;
		ОтправлятьРегистрацииНО 			= Истина;
		ОтправлятьСтруктуруПредприятия 		= Истина;
		
		ОтправлятьВедомостиКакЗаявки 	= Ложь;
		ОтправлятьВедомости 			= Ложь;
		ОтправлятьСотрудников 			= Ложь;
		
	ИначеЕсли ВариантНастройки = ОбменДаннымиУниверсальныйФормат.ВариантНастройкиОбменУниверсальный() Тогда
		
		ВерсияФорматаОбмена = "1.3";
		
		ДанныеДляФормированияПроводокОтправлятьСводно = Истина;
		ОтправлятьРегламентированныеОтчеты 	= Ложь;
		ОтправлятьВсехФизическихЛиц 		= Истина;
		ОтправлятьБухучет 					= Истина;
		ОтправлятьСтатистикуПерсонала 		= Истина;
		ОтправлятьУдержанныйНДФЛ 			= Истина;
		ОтправлятьРезервы 					= Истина;
		ОтправлятьВидыРабот 				= Истина;
		ОтправлятьВсеДолжности 				= Истина;
		ОтправлятьРегистрацииНО 			= Истина;
		ОтправлятьСтруктуруПредприятия 		= Истина;
		
		ОтправлятьВедомостиКакЗаявки 	= Ложь;
		ОтправлятьВедомости 			= Ложь;
		ОтправлятьСотрудников 			= Ложь;
		
	ИначеЕсли ВариантНастройки = ОбменДаннымиУниверсальныйФормат.ВариантНастройкиОбменаУНФ() Тогда
		
		ВерсияФорматаОбмена = "1.17";
		
		ОтправлятьРегламентированныеОтчеты = Ложь;
		ОтправлятьВедомости 			= Истина;
		ОтправлятьВедомостиКакЗаявки 	= Ложь;
		ОтправлятьВсехФизическихЛиц 	= Ложь;
		ОтправлятьБухучет 				= Истина;
		ОтправлятьСтатистикуПерсонала 	= Ложь;
		ОтправлятьУдержанныйНДФЛ 		= Ложь;
		ОтправлятьРезервы 				= Ложь;
		ОтправлятьВидыРабот 			= Истина;
		ОтправлятьВсеДолжности 			= Ложь;
		ОтправлятьРегистрацииНО 		= Истина;
		
		ОтправлятьСтруктуруПредприятия 	= Истина;
		ОтправлятьСотрудников 			= Истина;
		
	ИначеЕсли ВариантНастройки = ОбменДаннымиУниверсальныйФормат.ВариантНастройкиОбменаДО() Тогда
		
		ВерсияФорматаОбмена = "1.17";
		
		ОтправлятьРегламентированныеОтчеты = Ложь;
		ОтправлятьВедомости 			= Ложь;
		ОтправлятьВедомостиКакЗаявки 	= Ложь;
		ОтправлятьВсехФизическихЛиц 	= Истина;
		ОтправлятьБухучет 				= Ложь;
		ОтправлятьСтатистикуПерсонала 	= Ложь;
		ОтправлятьУдержанныйНДФЛ 		= Ложь;
		ОтправлятьРезервы 				= Ложь;
		ОтправлятьВидыРабот 			= Ложь;
		ОтправлятьВсеДолжности 			= Истина;
		ОтправлятьРегистрацииНО 		= Ложь;
		
		ОтправлятьСтруктуруПредприятия 	= Истина;
		ОтправлятьСотрудников 			= Истина;
		
	Иначе
		
		ВерсияФорматаОбмена = "1.3";
		
	КонецЕсли;
	
КонецПроцедуры

Функция ВерсияФорматаНижеВерсии(ПроверяемаяВерсия)

	Возврат ОбменДаннымиУниверсальныйФормат.СравнитьВерсии(ВерсияФорматаОбмена, ПроверяемаяВерсия) < 0;

КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
